; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	spectrograph0 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star3 - direction
	Star2 - direction
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 124)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star3)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 152)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star3)
	(supports instrument6 spectrograph2)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 126)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 154)
	(= (data Star4 spectrograph0) 103)
	(= (data Star5 spectrograph0) 211)
	(= (data Planet6 spectrograph0) 126)
	(= (data Star7 spectrograph0) 10)
	(= (data Planet8 spectrograph0) 261)
	(= (data Star4 spectrograph2) 103)
	(= (data Star5 spectrograph2) 152)
	(= (data Planet6 spectrograph2) 74)
	(= (data Star7 spectrograph2) 60)
	(= (data Planet8 spectrograph2) 203)
	(= (data Star4 spectrograph1) 286)
	(= (data Star5 spectrograph1) 288)
	(= (data Planet6 spectrograph1) 244)
	(= (data Star7 spectrograph1) 230)
	(= (data Planet8 spectrograph1) 56)
	(= (slew_time Star3 GroundStation0) 17.37)
	(= (slew_time GroundStation0 Star3) 17.37)
	(= (slew_time Star3 GroundStation1) 1.187)
	(= (slew_time GroundStation1 Star3) 1.187)
	(= (slew_time Star3 Star2) 37.33)
	(= (slew_time Star2 Star3) 37.33)
	(= (slew_time Star2 GroundStation0) 35.03)
	(= (slew_time GroundStation0 Star2) 35.03)
	(= (slew_time Star2 GroundStation1) 33.56)
	(= (slew_time GroundStation1 Star2) 33.56)
	(= (slew_time GroundStation1 GroundStation0) 21.85)
	(= (slew_time GroundStation0 GroundStation1) 21.85)
	(= (slew_time Star4 GroundStation0) 4.644)
	(= (slew_time GroundStation0 Star4) 4.644)
	(= (slew_time Star4 GroundStation1) 29.72)
	(= (slew_time GroundStation1 Star4) 29.72)
	(= (slew_time Star4 Star2) 27.5)
	(= (slew_time Star2 Star4) 27.5)
	(= (slew_time Star4 Star3) 28.78)
	(= (slew_time Star3 Star4) 28.78)
	(= (slew_time Star5 GroundStation0) 17.28)
	(= (slew_time GroundStation0 Star5) 17.28)
	(= (slew_time Star5 GroundStation1) 49.04)
	(= (slew_time GroundStation1 Star5) 49.04)
	(= (slew_time Star5 Star2) 82.24)
	(= (slew_time Star2 Star5) 82.24)
	(= (slew_time Star5 Star3) 41.56)
	(= (slew_time Star3 Star5) 41.56)
	(= (slew_time Star5 Star4) 84.78)
	(= (slew_time Star4 Star5) 84.78)
	(= (slew_time Planet6 GroundStation0) 12.87)
	(= (slew_time GroundStation0 Planet6) 12.87)
	(= (slew_time Planet6 GroundStation1) 43.87)
	(= (slew_time GroundStation1 Planet6) 43.87)
	(= (slew_time Planet6 Star2) 27.86)
	(= (slew_time Star2 Planet6) 27.86)
	(= (slew_time Planet6 Star3) 47.03)
	(= (slew_time Star3 Planet6) 47.03)
	(= (slew_time Planet6 Star4) 56.85)
	(= (slew_time Star4 Planet6) 56.85)
	(= (slew_time Planet6 Star5) 6.396)
	(= (slew_time Star5 Planet6) 6.396)
	(= (slew_time Star7 GroundStation0) 29.08)
	(= (slew_time GroundStation0 Star7) 29.08)
	(= (slew_time Star7 GroundStation1) 63.13)
	(= (slew_time GroundStation1 Star7) 63.13)
	(= (slew_time Star7 Star2) 8.901)
	(= (slew_time Star2 Star7) 8.901)
	(= (slew_time Star7 Star3) 2.535)
	(= (slew_time Star3 Star7) 2.535)
	(= (slew_time Star7 Star4) 8.668)
	(= (slew_time Star4 Star7) 8.668)
	(= (slew_time Star7 Star5) 13.88)
	(= (slew_time Star5 Star7) 13.88)
	(= (slew_time Star7 Planet6) 40.9)
	(= (slew_time Planet6 Star7) 40.9)
	(= (slew_time Planet8 GroundStation0) 55.9)
	(= (slew_time GroundStation0 Planet8) 55.9)
	(= (slew_time Planet8 GroundStation1) 12.99)
	(= (slew_time GroundStation1 Planet8) 12.99)
	(= (slew_time Planet8 Star2) 38.31)
	(= (slew_time Star2 Planet8) 38.31)
	(= (slew_time Planet8 Star3) 18.79)
	(= (slew_time Star3 Planet8) 18.79)
	(= (slew_time Planet8 Star4) 34.68)
	(= (slew_time Star4 Planet8) 34.68)
	(= (slew_time Planet8 Star5) 51.27)
	(= (slew_time Star5 Planet8) 51.27)
	(= (slew_time Planet8 Planet6) 72.49)
	(= (slew_time Planet6 Planet8) 72.49)
	(= (slew_time Planet8 Star7) 41.06)
	(= (slew_time Star7 Planet8) 41.06)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite3 GroundStation1)
	(have_image Star4 spectrograph1)
	(have_image Star5 spectrograph0)
	(have_image Star7 spectrograph2)
	(have_image Planet8 spectrograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 124 to 96.14, (fuel-used) from 0 to 27.86
   goals met: 1 of 6
2. (turn_to satellite3 groundstation1 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 154 to 104.96, (fuel-used) from 27.86 to 76.9
   goals met: 2 of 6
3. (turn_to satellite2 groundstation0 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 126 to 104.15, (fuel-used) from 76.9 to 98.75
   goals met: 2 of 6
4. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 2 of 6
5. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 6
6. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 2 of 6
7. (turn_to satellite2 star5 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 104.15 to 86.87, (fuel-used) from 98.75 to 116.03
   goals met: 2 of 6
8. (calibrate satellite3 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 2 of 6
9. (turn_to satellite3 star4 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star4)
   changed: (fuel satellite3) from 104.96 to 75.24, (fuel-used) from 116.03 to 145.75
   goals met: 1 of 6
10. (take_image satellite3 star4 instrument7 spectrograph1)
   added: (have_image star4 spectrograph1)
   changed: (data_capacity satellite3) from 1000 to 714, (data-stored) from 0 to 286
   goals met: 2 of 6
11. (turn_to satellite3 star7 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 star7)
   changed: (fuel satellite3) from 75.24 to 66.572, (fuel-used) from 145.75 to 154.418
   goals met: 2 of 6
12. (take_image satellite3 star7 instrument7 spectrograph2)
   added: (have_image star7 spectrograph2)
   changed: (data_capacity satellite3) from 714 to 654, (data-stored) from 286 to 346
   goals met: 3 of 6
13. (turn_to satellite3 planet8 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet8)
   changed: (fuel satellite3) from 66.572 to 25.512, (fuel-used) from 154.418 to 195.478
   goals met: 3 of 6
14. (take_image satellite3 planet8 instrument7 spectrograph1)
   added: (have_image planet8 spectrograph1)
   changed: (data_capacity satellite3) from 654 to 598, (data-stored) from 346 to 402
   goals met: 4 of 6
15. (turn_to satellite3 groundstation1 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 25.512 to 12.522, (fuel-used) from 195.478 to 208.468
   goals met: 5 of 6
16. (take_image satellite2 star5 instrument4 spectrograph0)
   added: (have_image star5 spectrograph0)
   changed: (data_capacity satellite2) from 1000 to 789, (data-stored) from 402 to 613
   goals met: 6 of 6
